snlkuharlocal/src/Documents/РазработкаНовойНоменклатуры/РазработкаНовойНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазработкаНовойНоменклатуры</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделенияПродажи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоставкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолоВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.ПоловозрастныеПризнакиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.ФР_Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>СырьеваяСоставляющая</name>
    <type>
      <types>CatalogRef.МатериалыСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>РазменрныйРяд</name>
    <type>
      <types>CatalogRef.Размеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЦветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПапкуАналитическихДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПродукции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоАналога</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоПЗО</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйПериодПроведенияАссортиментногоКомитета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>CatalogRef.СтатусыВыполненияРазработкиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПолученияОбразцов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаПолученияОбразцов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПолученияФото</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХудожетсвенноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеференсУпаковки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РеференсФотоСессии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаПоставкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяСтадияДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДизайнМакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАртикула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.КоллекцииДляСайта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.ТипыТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>WB_СПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>WB_СПП_А</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезоннаяКоллекция</name>
    <type>
      <types>CatalogRef.СезоннаяКоллекция</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаТайминга</name>
    <type>
      <types>CatalogRef.ЭтапыРазработкиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.МаршрутыЭтаповТаймингаРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьМодели</name>
    <type>
      <types>EnumRef.УникальностьПроизводстваМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусМодели</name>
    <type>
      <types>EnumRef.СтатусыПроизводстваМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАссортимента</name>
    <type>
      <types>EnumRef.СтатусыАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДостаки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговоеКоличествоЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDСтатус</name>
    <type>
      <types>EnumRef.LDСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбразца</name>
    <type>
      <types>EnumRef.СтатусыОбразцов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PPSСтатус</name>
    <type>
      <types>EnumRef.PPSСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтгрузки</name>
    <type>
      <types>EnumRef.СтатусОтгрузкиМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АссортиментныйКомитет</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.АссортиментныйКомитет</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыАссортиментногоКомитета</types>
      </type>
    </attributes>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокРазмеров</name>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.Размеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсходникиФотоСессий</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Презентации</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МакетыУпаковки</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тайминг</name>
    <attributes>
      <name>ЭтапРазработки</name>
      <type>
        <types>CatalogRef.ЭтапыРазработкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СостоянияДляЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/РазработкаНовойНоменклатуры/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.Пользователь;
	ТоварнаяКатегория 			= ОбъектКопирования.ТоварнаяКатегория;
	ПодразделенияПродажи 		= ОбъектКопирования.ПодразделенияПродажи;
	ВидНоменклатуры				= ОбъектКопирования.ВидНоменклатуры;
	Брэнд 						= ОбъектКопирования.Брэнд;
	СырьеваяСоставляющая 		= ОбъектКопирования.СырьеваяСоставляющая;
	СсылкаНаПапкуАналитическихДанных 				= ОбъектКопирования.СсылкаНаПапкуАналитическихДанных;
	ПлановыйПериодПроведенияАссортиментногоКомитета = ОбъектКопирования.ПлановыйПериодПроведенияАссортиментногоКомитета;
	ПлановаяДатаПолученияОбразцов 					= ОбъектКопирования.ПлановаяДатаПолученияОбразцов;
	ПлановыйОбъем 				= ОбъектКопирования.ПлановыйОбъем;
	ПолоВозрастнойПризнак 		= ОбъектКопирования.ПолоВозрастнойПризнак;
	
	ТекущаяСтадияДокумента = 1;
	АссортиментныйКомитет.Очистить();
	ИсходникиФотоСессий.Очистить();
	Презентации.Очистить();
	МакетыУпаковки.Очистить();
	
КонецПроцедуры
